Revit 2027 API
ParameterTypeId.RoomSpaceTypeParam Property
 "Space Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoomSpaceTypeParam { get; }
Public Shared ReadOnly Property RoomSpaceTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoomSpaceTypeParam {
	ForgeTypeId^ get ();
}
static member RoomSpaceTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace